IPHONE/README.md
```mermaid
classDiagram
    class NavegadorInternet {
        +exibirPagina()
        +adicionarNovaAba()
        +atualizarPagina()
    }

    class SafariNavegador {
        +exibirPagina()
        +adicionarNovaAba()
        +atualizarPagina()
    }

    class Iphone {
        +main(String[] args)
    }

    class Ipod {
        +tocarMusica()
        +pausarMusica()
        +selecionarMusica()
    }

    class ExecutarIpod {
        +tocarMusica()
        +pausarMusica()
        +selecionarMusica()
    }

    class AparelhoTelefonico {
        +ligar()
        +atender()
        +iniciarCorreioVoz()
    }

    class ChamadasTelefonicas {
        +ligar()
        +atender()
        +iniciarCorreioVoz()
    }

    NavegadorInternet <|.. SafariNavegador
    Iphone --> NavegadorInternet
    Iphone --> Ipod
    Ipod <|.. ExecutarIpod
    Iphone --> AparelhoTelefonico
    AparelhoTelefonico <|.. ChamadasTelefonicas

```
